Tekla Open API Reference for Tekla Structures 2025
Weld.WeldPositionEnum Enumeration
 The weld position.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldPositionEnum
Public Enumeration WeldPositionEnum
Members
Member name | Value | Description
WELD_POSITION_PLUS_X | 1 |  The position +x.
WELD_POSITION_MINUS_X | 2 |  The position -x.
WELD_POSITION_PLUS_Y | 3 |  The position +y.
WELD_POSITION_MINUS_Y | 4 |  The position -y.
WELD_POSITION_PLUS_Z | 5 |  The position +z.
WELD_POSITION_MINUS_Z | 6 |  The position -z.
See Also
Reference
Tekla.Structures.Model Namespace